<script>
    import projects from '$lib/images/projects.jpg';
    import prj from '$lib/images/prj.jpg';
    import chamama from '$lib/images/chamama.png'
    import finish from '$lib/images/finish.png'
    import Card from './Card.svelte';
    
    let text = [
        `בית ספר החממה זה בית ספר ללמידה אישית
        לכן במגמה שלנו אנחנו נעזרים בקורסים אונליין ומנטורים כדי ללמוד
        על מנת להתקדם בלמידה שאנחנו התלמדים רוצים להתקדם בה
        כול תלמדים במגמה בוחר לבד מה הם רוצים ללמוד
        !אם זה בניית אתרים, סייבר, הכנת משחקים ועוד
        כול חודש/חודשיים אנחנו מציגים פרוייקט שמראה מה למדנו בתקופה
        בעזרת החומר שאנחנו לומדים כול תקופה אנחנו מציגים את היכולות שלנו`,
        `
        Consequat aliquip excepteur dolor cupidatat eu tempor amet sint laborum culpa.
        Et velit exercitation aliqua sunt pariatur aliqua ipsum enim reprehenderit et sunt cillum sint sit.
        `,
        `
            ,בבית ספרנו יש 2 מגמות קיימות כרגע הייטק ומייקרס
            על מנת לסיים את הלימודים בבית ספר עם תעודת גמר ותעודת מקצוע
            התלמידים צריכים לסיים 3 שלבים למגמה וכול סיום שלב התלמיד מקבל סיכה
            ,במגמת ההייטק כדי להשיג סיכה ראשונה יש ללמוד תחומי ליבה במדעי המחשב 
            על מנת להשיג סיכה שנייה צריכים ללמוד ולעבור קורסים מקצועיים לפי המקצוע במדעי המחשב לבחרתך
            ...כמו סייבר דאטא בניית אתרים וכו
            בשנה שלישית לשנה התלמידים עושים פרוייקט גמר על מנת להשלים את הלימודים של המגמה
            .הפרוייקט מכיל את מה שהתלמיד למד בקורסים המקצועים שהציעו להם 
            בזמן הפרוייקט כמו כול פרוייקט המאסטר מדריך אותך כדי שתעמוד בדרישות של הפרוייקט
            .ובסיום הפרוייקט התלמיד מקבל את תעודת המקצוע שלו
            `
    ];
 </script>
 
<<<<<<< HEAD
 <Card image={[projects, chamama, chamama]} {text} header={[`?איך אנחנו לומדים`, `הלמידה בשנה ראשונה`, 'הלמידה בשנה שנייה']} />
=======
 <Card image={[projects, prj, finish]} {text} header={[`?איך אנחנו לומדים`, `פרוייקטים`, 'מגמות ותעודת מקצוע']}/>
>>>>>>> 8ed8d25 (I ABOUT TO FINISHHH)
