<script>
    import projects from '$lib/images/projects.jpg';
    import prj from '$lib/images/prj.jpg';
    import chamama from '$lib/images/chamama.png'
    import finish from '$lib/images/finish.png'
    import Card from './Card.svelte';
    
    import { onMount } from 'svelte';

	let scroll_allowed = false;
    onMount(() => {
      scroll_allowed = true;
    })

    let text= [
        `
        בית ספר החממה הוא בית ספר ללמידה אישית
    לכן במגמה שלנו אנו נעזרים בקורסים אונליין ומנטורים כדי ללמוד
    על מנת להתקדם בלמידה שאנו התלמדים רוצים להתקדם בה
    כל תלמיד במגמה בוחר לבד מה הם רוצים ללמוד
    אם זה בניית אתרים, סייבר, הכנת משחקים ועוד
    כול תלמדים במגמה בוחרים לבד מה הם רוצים ללמוד
    בכל חודש או חודשיים אנחנו מציגים פרוייקט שמראה מה למדנו בתקופה
    בעזרת החומר שאנו לומדים כול תקופה אנחנו מציגים את היכולות שלנו`,
        `
        כול שנה יש חמישה תקופות לפרוייקטים
    מיני פרוייקט / תחילת שנה, פרוייקט סתיו, פרוייקט חורף, פרוייקט אביב ולבסוף פרוייקט קיץ
    כול תקופה של פרוייקט התלמיד משבץ את עצמו למאסטר שיעזור לו למצוא פרוייקט פרוטקטיבי
    שיעזור לו ללמוד דברים חדשים או להרוויח ממנו
    תפקיד התלמיד זה למצוא את הפרוייקט שעובר על הדרישות של המאסטר ושהוא אוהב את הרעיון 
    כול שבוע המאסטר ידריך וידאג שהתלמיד עובד בצורה פרוטקטיבית על הפרוייקט עד לסוף התקופה
        `,
        `
        בבית ספרנו יש 2 מגמות קיימות כרגע הייטק ומייקרס
    על מנת לסיים את הלימודים בבית ספר עם תעודת גמר ותעודת מקצוע
    התלמידים צריכים לסיים 3 שלבים למגמה וכול סיום שלב התלמיד מקבל סיכה
    במגמת הייטק כדי להשיג סיכה ראשונה יש ללמוד תחומי ליבה במדעי המחשב 
    על מנת להשיג סיכה שנייה צריכים ללמוד ולעבור קורסים מקצועיים לפי המקצוע במדעי המחשב לבחירתך
    כמו סייבר דאטא בניית אתרים וכו
    בשנה השלישית לשנה התלמידים עושים פרוייקט גמר על מנת להשלים את הלימודים של המגמה
    הפרוייקט מכיל את מה שהתלמיד למד בקורסים המקצועיים שהציעו לו
    בזמן הפרוייקט כמו כול פרוייקט המאסטר מדריך אותך כדי שתעמוד בדרישות של הפרוייקט
    ובסיום הפרוייקט התלמיד מקבל את תעודת המקצוע שלו
                `
    ];
 </script>
<svelte:head>
	<title>עמוד למידה</title>
	<meta name="viewport" content="width=device-width, initial-scale=1">
</svelte:head>
 
 <Card image={[projects, prj, finish]} {text} header={[`?איך אנחנו לומדים`, `פרוייקטים`, 'מגמות ותעודת מקצוע']}/>

 {#if scroll_allowed}
  <style>:root{--scroll: hidden;}</style>
{/if}
<style>
    
 </style>