<script>
    import projects from '$lib/images/projects.jpg';
    import Card from './Card.svelte';
  </script>

<Card image={projects} text={
`בית ספר החממה זה בית ספר ללמידה אישית
לכן במגמה שלנו אנחנו נעזרים בקורסים אונליין ומנטורים כדי ללמוד
על מנת להתקדם בלמידה שאנחנו התלמדים רוצים להתקדם בה
כול תלמדים במגמה בוחר לבד מה הם רוצים ללמוד
!אם זה בניית אתרים, סייבר, הכנת משחקים ועוד
כול חודש/חודשיים אנחנו מציגים פרוייקט שמראה מה למדנו בתקופה
בעזרת החומר שאנחנו לומדים כול תקופה אנחנו מציגים את היכולות שלנו`
}
header={`?איך אנחנו לומדים`}
/>
