<h1 class="txt2">?איך אנחנו לומדים במגמה</h1>

<p class="txt1">,בית ספר החממה זה בית ספר ללמידה אישית</p>
<p class="txt1">.לכן במגמה שלנו אנו נעזרים במנטורים שמדריכים אותנו בלמידה שלנו</p>
<p class="txt1">המנטורים מדריכים אותנו כדי להצליח ולהוציא כמה שיותר תוצרים מהלמידה שלנו</p>
<p class="txt1"> במהלך הלמידה אנחנו בוחרים מה התחום שאנחנו לומדים ומכינים פרוייקט בהתאם ללמידה שלנו</p>
<p class="txt1">בעזרת הפרוייקטים שלנו אנחנו צוברים ניסיון וידע שנוכל להשתמש לעתיד שלנו </p>
<p class="txt1"> .על מנת להכין מערכות להתקבל לעבודות או למקומות שצריך להציג בהם את העבר והידע שלך</p>


<style>
    .txt1{
        color: rgb(0, 68, 255);
        margin: 0;       
        margin-top: 1.5svh;
    }

    .txt2{
        color: rgb(0, 4, 255);
    }
</style>


